[
    {
        "MB": 11,
        "Ranking": 4,
        "Stars": "★★★★",
        "Remarks": "Fortunes favourite, Leaders / Business Due to the double impact of sun, the qualities of the said plant would come up brilliantly. These people will be dignified, honest, bold, intelligent and independent. They can be good leaders and can make good politicians. An incorrect name no will the native low on self confidence, will not be able to rise up in life. These people will look older than their age, as they will have a lot of eye sight issues.",
        "Profession": "Fire, food, electricity, iron etc. They can also be politician, administrators or hold high positions in govt organisations."
    },
    {
        "MB": 12,
        "Ranking": 4,
        "Stars": "★★★★",
        "Remarks": "You will fulfil all that you take up in life provided u have good name number. You will work far more efficiently for others than if you work independently. In case, you work independently, you will remain confused between the choices to make. You are physically strong but mentally emotional or sensitive.",
        "Profession": "Water related professions, dairy farming, export/import business, spirituality, Navy / Water or Milk related business (2 Representing Moon) "
    },
    {
        "MB": 13,
        "Ranking": 3.5,
        "Stars": "★★★✫",
        "Remarks": "1-3 people can rise to top positions because of their knowledge and wisdom. They will set examples for others to do better and to reach on higher positions. Interested in spirituality & arts. They will rise in society and in their life due to their efforts and hard work. They will always have the blessings of guru (attribute of no. 3, Jupiter). They are good mathematicians and have a blessing to be able to look into the future. A defective name number will give them mental distress.",
        "Profession": "Best for Occult / Education, Fire, iron, politician, administrators, or high positions in govt organisations"
    },
    {
        "MB": 14,
        "Ranking": 3,
        "Stars": "★★★",
        "Remarks": "They are good public speakers and writers and will have the power to change and influence the opinion of people. They would not take up things on its face but would analyze everything on their own.\r\nIn case of defective name number, they would talk too much, and would get addicted to liquor.",
        "Profession": "Astrology, medicine, writer, public speaker, import/export business and machine manufacturing, Politics / Business (1 – Sun {King} & 4 - Rahu)"
    },
    {
        "MB": 15,
        "Ranking": 4,
        "Stars": "★★★★",
        "Remarks": "They are extremely intelligent. Their mind is like an idea-generating machine. They make the most of all opportunities come their way and derive success from it. They are friends with everyone. They have the ability to do inventions. They have excellent business skills.",
        "Profession": "Media / Journalist, Import/export, manufacturing, counsellor & guide, iron, metal "
    },
    {
        "MB": 16,
        "Ranking": 3.5,
        "Stars": "★★★✫",
        "Remarks": "They are quite artistic. They become successful and possess huge wealth. They will have a good family and married life. They enjoy all the pleasures in life. They appreciate beautiful things & have a love for nature. They will have all the required comforts and luxuries of life.\r\nIn case of a wrong name number, they will get into trouble due to the opposite sex (especially women), will be lustful and extravagant. They will spend a huge amount of money on things of luxury to maintain their status.",
        "Profession": "Luxury / Glamour, Media, Fashion, Arts, jewellery, fashion, luxury items, and food articles."
    },
    {
        "MB": 17,
        "Ranking": 3,
        "Stars": "★★★",
        "Remarks": "They are spiritually driven. They do not enjoy a life full of extravaganza rather they would want to do something for the welfare of the society. They have abundant faith in god. They have the ability to become spiritual leaders. They will succeed in any business they take up.\r\nIn case of an unfit name number, you will have mental suffering, marital life discord, and face issues with childbirth.",
        "Profession": "Best for Occult / Education / Research, Spirituality, practitioner, arts, metals, drugs, fire"
    },
    {
        "MB": 18,
        "Ranking": 0.5,
        "Stars": "✫",
        "Remarks": "People with such a combination can be leaders with a divine bend of mind. They more spiritual they are, the easier would be for them to cross the hurdles on the way. Once they take up task, they would proceed as they like regardless of what others feel.\r\nIn case of problematic name number, they can become a criminal & can also suffer from grief, poverty and accidents.",
        "Profession": "Difficulties / Police, Steel, fire, real estates, transport related business"
    },
    {
        "MB": 19,
        "Ranking": 5,
        "Stars": "★★★★★",
        "Remarks": "They are very patriotic and have an understanding of the law. They are action oriented and have a proper direction in life. They hate being dominated or working under someone. They will not tolerate injustice.\r\nUnsuitable names can bring them mental worries from women.",
        "Profession": "Super Successful, Architecture, manufacturing, brick manufacturing, electricity and computers."
    },
    {
        "MB": 21,
        "Ranking": 4,
        "Stars": "★★★★",
        "Remarks": "No. 2 Queen, No. 1 King. these people if born in poor families, can gain lot of success due to their skills. They take time to get successful in life. These people are full of energy. They are highly developed imaginative skills & with the influence of the sun, they will be able to convert their imaginations into reality.\r\nIf they have a good name number, they will acquire good house, vehicles & job. And if have an incompatible name number, they will be mentally confused, will face failures in life & domestic life.",
        "Profession": "They can be story writers, agriculturists, chemicals related work, sea related grade and scientists"
    },
    {
        "MB": 22,
        "Ranking": 2,
        "Stars": "★★",
        "Remarks": "This is not a good combination. They have mood swings like moon. Sometimes they are very happy and sometimes just opposite. Being having emotional features, they always need support in life. They are not capable enough to get success in life. But, hey have strong intuitional power.\r\nIn case the name number is not suitable, they will remain very confused in life, and will depend on others for support & remain depressed.",
        "Profession": "Best for water related work / Navy / Sweets / Cold drink, They can do works related to water, agriculture, story writing, philosopher, psychiatrist, physiologist, poetry and lyrics."
    },
    {
        "MB": 23,
        "Ranking": 2.5,
        "Stars": "★★✫",
        "Remarks": "They work better under someone as they are able to use their own knowledge in a better way. They get success little late but will definitely be successful. With the help of no. 3, their intuitional skills are very good. They can be good singers, and politicians.\r\nBut if having any problem in name no, can be cheated or betrayed. They may have issues related to finances, domestic life, health, children etc. It would also give them unsteady life.",
        "Profession": "Education / Healer / Teacher / Doctor, Science, medicine, newspaper, related to education, literary books, and mass communication."
    },
    {
        "MB": 24,
        "Ranking": 1.5,
        "Stars": "★✫",
        "Remarks": "2 (QUEEN) & 4 (DARING, DABANG) is not a good combination. They can be harmful for each other. Sometimes, can face lot of problems in life due to their wrong decision. Because no 4 (rahu) creates a lot of problems for no. 2(queen). But they are having very good imagination power. A wrong name number may give them issued related to health, finances, domestic life etc.. it would also give them an unsteady life.",
        "Profession": "2-Queen not comfortable with 4- Robin Hood, Film actor, photographer, director, vehicles, arts, books, mass communication "
    },
    {
        "MB": 25,
        "Ranking": 3,
        "Stars": "★★★",
        "Remarks": "They are intelligent & sharp businessman. With the moon giving imaginative skills, and mercury giving all the business sense, you can be real inventors & can be one of those owning a new age start-up. You can do well in any field. You have your minds inclined towards betting and speculation.\r\nIncompatible name number will prohibit you from taking decisions which you are capable of taking. The energy of Mercury will get wasted.",
        "Profession": "Arts, advertisement, engineering, stock market, commission related businesses, sea trades, and spiritual objects.**"
    },
    {
        "MB": 26,
        "Ranking": 2.5,
        "Stars": "★★✫",
        "Remarks": "These people are rich bcoz of Venus in their life. they will be well endowed with the luxuries of life. They can take benefits from opposite sex. They will attract everyone with their speaking skills. They r going to have many friends in life. They have keen interest in music and dance. In case of wrong name no, they can become greedy and can even lose their character.",
        "Profession": "Perfumes, beauty creams, pharma, event management, soft drinks, cosmetics, agriculture and photography."
    },
    {
        "MB": 27,
        "Ranking": 2.5,
        "Stars": "★★✫",
        "Remarks": "This is an average combination. They are having a mystical mind. They don’t have their own identity. Bcoz of this, they can feel ignored or insulted by the people. If they are not having 1 or 5 in their chart, they can be absent minded. They always need support to grow.\r\nIf having incompatible name no., they would not be able to earn material riches, marriage would be delayed or there would be possibilities of no marriage.",
        "Profession": "Arts, spirituality, drugs, chemicals, food items, yoga, astrology or occult related subjects. Best Intuition Power"
    },
    {
        "MB": 28,
        "Ranking": 0.5,
        "Stars": "✫",
        "Remarks": "Since 2 represents Moon (water) and 8 represents (Shani, iron). This is not a good combination provided they are having good name number. As water is not good for iron, it creates rust. 8 takes care of the financial needs of the family & 2 being nurturing caring takes of the needs of the family so they should have a proper work life balance. In case, their name number doesn’t go well with 2-8, it would spell doom for them. Saturn will bring hardships & the moon will bring the upswing and downswing. They will be prone to depression, accidents, delays etc.. Precaution in Health (2(Water) - Queen and 8(Iron)- Stepson)",
        "Profession": "Iron & steel , mining, metals, vehicles, spare parts, minerals and electrical manufacturing."
    },
    {
        "MB": 29,
        "Ranking": 1,
        "Stars": "★",
        "Remarks": "They are having brave soul. They are not even scared to people more powerful than them. They do not have self control.. Both the numbers have qualities make up for wat the other number is lacking. Once, they make up their mind, can stand up for justice and can go to any extent. 2 being Queen’s no has nothing to do with No. 9, Senapati. But if having wrong name no., can face sudden swings in career and family life.",
        "Profession": "Earth, real estate, police, army, navy, merchant navy, contractors, farmers, agriculturists, fire, acids fertilizers and milk related business."
    },
    {
        "MB": 31,
        "Ranking": 3.5,
        "Stars": "★★★✫",
        "Remarks": "They are very devoted to their work and that too in a disciplined manner. The combination of king and guru in itself is a very good combination. They get successful in the fields of art and education and they always get good results. If they pursue their career related to education (can be anything) then they get very good and impressive results and will reach the heights. If not having good name number, they will have the tendency to cheat people and misguide others. Finances may suffer and they can also bring disrepute to themselves.",
        "Profession": "Best for Occult / Education, Related to chemicals, teaching, education, grains, electronics, fire, electricity"
    },
    {
        "MB": 32,
        "Ranking": 2.5,
        "Stars": "★★✫",
        "Remarks": "This is an average combination but can be good if supported by a perfect name number. They have strong imagination skills. They earn more money internationally than in their own country. They will have all the comforts of life and can do very well in their own field. Negative name number can make the native incompetent in business, suspicion uses most of their energy, their knowledge and wisdom gets wasted.",
        "Profession": "Education / Healer / Teacher / Doctor, Commission related business, manufacturing cosmetics, soft drinks, perfumes and import."
    },
    {
        "MB": 33,
        "Ranking": 3,
        "Stars": "★★★",
        "Remarks": "They are ideal and wise. They get higher education. They are knowledgeable and people take advice from them. They act as guides for people in maters or otherwise. They always give good advice. They can have high positions of high responsibility in large organisations.\r\nIf having unfavourable name number, they will earn an bad name in the society and their financial health will suffer.",
        "Profession": "Best for education / Occult, Knowledge related, Astrologer, medical practitioner, scientist, import/export business, teaching, education industry and head of a religious organisation."
    },
    {
        "MB": 34,
        "Ranking": 2,
        "Stars": "★★",
        "Remarks": "This is not a good combination. If they are having good knowledge, they can be little arrogant. They don’t think before they speak. They have high dreams, and are helpful which makes them famous among people. They have the capacity to go on & on about subject if they start talking.\r\nIf not having a good name number, the become stubborn, arrogant. They will have superiority complex that everyone else would appear inferior to them.",
        "Profession": "Good for Sales & Marketing, Social activist, legal advisors, judge, politician, speaker"
    },
    {
        "MB": 35,
        "Ranking": 3,
        "Stars": "★★★",
        "Remarks": "This combination is very good. They get lot of success in life. They need to control what they talk, otherwise can face problems. They earn a lot of money in life and reach the heights. They can get lot more from this 3 & 5 combination provided they are having good name number.\r\nIn case of problematic name number, they can face obstacles in life and don’t get enough results of their efforts they are putting in any work. They might earn bad name incompetence at work or financial trouble.",
        "Profession": "Finance, educational institutions, banking sector jobs"
    },
    {
        "MB": 36,
        "Ranking": 0.5,
        "Stars": "✫",
        "Remarks": "They are ruled by 3(dev guru, preceptors of angels) and 6 (daitya guru, preceptors of demons). They invite trouble themselves by their own actions. They will face problem with their opposite sex and will be extremely lustful. They don’t grow in any field. Their family as well as professional life is bit disturbed.\r\nIn case of wrong name number, it will make the worse situation even more worse. They can push themselves into undesirable ways to earn money. They will have excessive lust and can face lot of difficulties because of this.",
        "Profession": "Luxury goods, textiles, commission based work, art galleries, and educational institutions"
    },
    {
        "MB": 37,
        "Ranking": 4,
        "Stars": "★★★★",
        "Remarks": "This number depicts the symbol of OM. This is a very good combination. These people enjoy high designations and get success in what they do. These people can be I.A.S., I.P.S.. they are highly qualified and work on high posts. They hold noble deeds. They speak very less and only on topics that require attention.\r\nIf having wrong name number, can be a bit arrogant. They will have no friends in their life, and can have a disturbed family life.",
        "Profession": "Spirituality, astrology, gems, life saving drugs and educational establishments, Best for education / Occult / Healing and Teaching"
    },
    {
        "MB": 38,
        "Ranking": 2,
        "Stars": "★★",
        "Remarks": "This combination face lot of difficulties in the earlier phase of their life. But gradually, they achieve success. Their life is full of unnecessary and wasteful expenditure. They are prone to accidents, sudden events etc. If having wrong name number, they will get entangled in court cases, imprisonments, accidents etc.. possibility of wasteful expenditure and their hard work will not be paid off.",
        "Profession": "Metals, engineering, iron and steel, heavy machinery, gems, commission based work and speaker"
    },
    {
        "MB": 39,
        "Ranking": 4,
        "Stars": "★★★★",
        "Remarks": "They follow the life of discipline. They are capable of achieving a lot of success with their efforts. They are strong both physically and mentally. They can easily defeat their enemies. If they are having no. 1 in their life or even if their life partner is having that no, can touch the heights. If having wrong name number, they will have to face failures and hardships & the major portion of the life would waste struggling.",
        "Profession": "Police department, army, jobs of authority, gems, earth related, minerals and electronics."
    },
    {
        "MB": 41,
        "Ranking": 3.5,
        "Stars": "★★★✫",
        "Remarks": "They are full of practical knowledge and will be respected by people. People would want to be friends with them. They will be honest and have a mind set to help others. They dislike, dishonesty and show off. They have a sharp mind and have very good writing skills.If they have an appropriate name number, even after having good skills and knowledge can face frustration, progress would be delayed .",
        "Profession": "Law, politics, social development, writing, transport, furniture etc."
    },
    {
        "MB": 42,
        "Ranking": 2,
        "Stars": "★★",
        "Remarks": "This is an average no. They see lots of ups and downs in life due to the enmity between 4- 2 and presence of the moon. This is quite an unusual combination. They get success very late. They see very ups and downs in their life, sometimes very good, sometimes very bad. And will get good results only if having a good name number\r\nIn case the number is incompatible, there will be a constant fight in life to achieve desires.",
        "Profession": "Research oriented professionals like law, religion astrology or professions related to water, transport electricity, soft drinks chemicals and pharma."
    },
    {
        "MB": 43,
        "Ranking": 2,
        "Stars": "★★",
        "Remarks": "Such is the grace of Guru on you that you shine in academics & administrative circle. They do a lot for the society. They will reach top positions in government office or politics. They will be an asset to the organisation you work in – efficient, team worker and adaptable. If their name number is faulty, they will face obstacles and undesirable circumstances, they would not rise in life or their life would become stagnant.",
        "Profession": "Government official, politician, lawyer, accountant, professor, pharma, furniture, hotels"
    },
    {
        "MB": 44,
        "Ranking": 1.5,
        "Stars": "★✫",
        "Remarks": "They will acquire knowledge of the worldly matters in their youth itself. They will scale up the ladder of achievements due to their enticing speech & writing. They will work unceasingly and will bring revolution in politics. They would earn more experience than money. If the name number is wrong, they will be poverty-stricken, will have to encompass many ordeals in life. Their life would be surrounded by difficulties.",
        "Profession": "Vehicles, export/import, medicine, chemicals, writer, poet, astrologers, and leaders."
    },
    {
        "MB": 45,
        "Ranking": 3,
        "Stars": "★★★",
        "Remarks": "They are talented and exhibit their talents by way of thought, speech and action. They have a very sharp memory. They attain success in whatever they do. They will take up projects and work hard to see the project till it completes. They would appear strict by their outward behaviour in reality, but will be gentle. They are a real businessman surrounded by people all the time and will have the ability to get the work done through them timely and efficiently. If wrong name number, they have to face many mental agonies, their business will not flourish, it will be a big drainage to their mental capacity.",
        "Profession": "Commission work, transport, vehicles, chemicals and export/import."
    },
    {
        "MB": 46,
        "Ranking": 3,
        "Stars": "★★★",
        "Remarks": "Both are capable of attaining a lot of name, fame and glory. They will enjoy all the pleasures of life. They get attached to beautiful things and have a sense of attraction in thereself. They can make good speaker and enjoy music, drama and literature. They get attracted towards beautiful things and attract others with their charming personality. If having bad name number, they will spend extravagantly even to the extent of going into debts, they would get into devious means to earn money, they would get into trouble with women or will be extremely lustful.",
        "Profession": "Arts, sale of luxury items, sale of perfumes, journalism, pharma, business of toys or anything of interest to children."
    },
    {
        "MB": 47,
        "Ranking": 4,
        "Stars": "★★★★",
        "Remarks": "As Rahu is having only head and not the body, ketu represents the body without head. But when they both met, they complete each other. This number is the key to success. They would be an ocean of knowledge, wisdom and intuition. They have a deep sense of thinkingand the ability of foresee due to their developed intuitive skills. They believe in honesty and justice. In case of a bad name number, they will suffer and feel dissatisfied. These 4 & 7 numbers represent opposite focus as one denoting wealth and the other renunciation.",
        "Profession": "Sports goods, engineering, medicines, luxury, commission work, transportation business, art and delivering speeches."
    },
    {
        "MB": 48,
        "Ranking": 1,
        "Stars": "★",
        "Remarks": "Its not a good combination. They never get success and used to taste failures in life. They will not get success even after putting lot of efforts). They are constantly worried about the future. Since the number has the impact of Saturn, they will come up the hard way. They keep their point very clearly and in a detailed way. If their number is inappropriate, they will fall in love and will have heartbreak. There will be poverty, failure in education, disturbed family life, and life would take unexpected turns.",
        "Profession": "Machinery, transport, vehicles, printing, export import business, commission related business and handicrafts."
    },
    {
        "MB": 49,
        "Ranking": 1,
        "Stars": "★",
        "Remarks": "They both number don’t help each other and doesn’t go well. One is strong and another one is very wise. They will have a harsh voice with the help of which they will be able to get work done. They will try and achieve everything they set their mind on without worrying about the consequences. They would get into gambling, racing, womanizing and alcohol. Wrong number name will make them use their energy destructively, any growth, if seen would be followed by a downfall, drainage of energy and skill, extreme desire for sexual pleasures.",
        "Profession": "Precaution in Health, Real estate, construction, textile, iron and steel, fire, electricity, jewellery, vehicles and commission work."
    },
    {
        "MB": 51,
        "Ranking": 4,
        "Stars": "★★★★",
        "Remarks": "This is actually a very good combination. 5 represents Prince and 1 represent King. if they are together, they make the best combination. They have a strong mind which is capable of looking at things from a different angle. They are inventive in nature. They will be successful in almost everything.\r\nIf having wrong number, they will waste their resources in evil ways, bring disrepute to the family, they will not be able to rise as higher as possible for them.",
        "Profession": "Art, drama, music, mechanical devices, spare parts, electronics and writing."
    },
    {
        "MB": 52,
        "Ranking": 3,
        "Stars": "★★★",
        "Remarks": "These people always get blessings from their mother. They take time to get success and reach on heights. They need to control their mind. They are physically strong and mentally weak. They don’t trust others. They can earn name & fame by writing or delivering lectures. People trust the advices given by them. Their intentions will be unusual and new. If having wrong name number, can make them confused, indecisive. They would set unrealistic targets for themselves and get depressed.",
        "Profession": "Fashion, commission business, luxury items, cosmetics"
    },
    {
        "MB": 53,
        "Ranking": 3,
        "Stars": "★★★",
        "Remarks": "This no is very good as Prince is having blessings of Guru. Their knowledge, wisdom and Intelligence makes them a good person. They are honest, fair and ethical in their conduct, always busy their work or making out the plans. They will not speak unnecessarily, until and unless they are required to speak something. But will definitely think before that. In case of wrong name no., they will meet failures in life. Their talent may be exploited, will earn a bad name etc..",
        "Profession": "Excellent communication / Anchoring / News / Reading / Acting / Teaching / Banking / Photographer (camera related), Educational institutions, fabrics, commission agencies, mass communication & journalism"
    },
    {
        "MB": 54,
        "Ranking": 3,
        "Stars": "★★★",
        "Remarks": "This is a good combination. They don’t follow the old rituals. They trust in taking risks for the growth of their life. They get success in every field of their life. Whether doing their own work or for society. Their personality includes discipline, justice and humanism.\r\nIn case of incorrect number, they would get involved in wasteful matters and can lose their calm, can earn a bad name, work will suffer and energy would be wasted in wishful thinking.",
        "Profession": "Banking / Event management / Sales & Marketing, Machinery, iron and steel, electronics, writing and speaking, export and import,"
    },
    {
        "MB": 55,
        "Ranking": 4,
        "Stars": "★★★★",
        "Remarks": "This is a very lucky number to have. They will be very successful and quick in handling tasks. A prince got the company of prince in this number. We are getting two five here. They will adopt new methods to achieve the goals. Always willing & ready to help people, will earn huge respect and support from people. They have enough mental strength that they do not lose their balance when faced with problems. In case the name number mismatches, the success would not be as much as in case with a perfect name number. They will get into evil ways like womanizing, cheating, and conducting forgery etc..",
        "Profession": "Very Successful, Romantic {Note: May Be Lazy), Arts, writing, speaking, commission machine manufacturing, accountant, teacher, astrologer"
    },
    {
        "MB": 56,
        "Ranking": 4.5,
        "Stars": "★★★★✫",
        "Remarks": "They are artistic to the core. Wealth, name & fame will all come to them. They will be surrounded by friends. When they would work, they would put their heart and soul into it and when it comes to rest, they would be as lazy as they can be. Things of beauty would be of interest to them. They will have extraordinary talents and the ability to attract people towards them.\r\nIf the name number is not compatible, their life will not progress and they will spend time in unhealthy conversation and money on wasteful things. They will get into evil ways to earn money.",
        "Profession": "Life is successful / Media / Luxury Related, Fashion designer, artist, shoe designer, mass communication, painter, machinery manufacturing, and automobiles "
    },
    {
        "MB": 57,
        "Ranking": 3,
        "Stars": "★★★",
        "Remarks": "They are intelligent and a deep thinker, they are compassionate to the needs of the downtrodden sections of the society. They are neat and tidy even when wearing simple clothes. They would keep their problem to themselves & dislike wasteful expenditure. They would know that they key to redemption is through gaining wisdom. If the name number is incompatible, they will lead a dissatisfied like full of confusion and struggle, their progress would be slow, family life will suffer.",
        "Profession": "Spiritual teacher, writer/speaker or can get into business of minerals, chemicals, mass communication, astrology"
    },
    {
        "MB": 58,
        "Ranking": 3,
        "Stars": "★★★",
        "Remarks": "Success will not come easily to them, they need to put lot of hardwork and struggle to get the result. But the amount of effort, they will put on in doing anything, will definitely get result of that. No. 8, Shanidev is known for giving results of the efforts & hardwork people put. If their name number is good, the struggle continues, unexpected events will affect their growth, they would be prone to accident, imprisonments etc..",
        "Profession": "Property / Real Estate, Iron & steel, machine manufacturing, melting metals, property, dealers, minerals & metals, heavy industries or labour oriented industries."
    },
    {
        "MB": 59,
        "Ranking": 3,
        "Stars": "★★★",
        "Remarks": "They have the ability to terrorize people especially their enemies. They are endowed with both mental and physical power. They are leaders and role models for their friends and loved ones but for their enemies they are in sense of dread. Nothing is impossible for their if they set their mind on it.\r\nIf the name number is unsuitable, they carry the excess energy wastefully or get into womanizing or develop their criminal instincts, they will be aimless in life.",
        "Profession": "Real estate, melting metals, politics, pharmaceutical, lawyers, commission business and export and import."
    },
    {
        "MB": 61,
        "Ranking": 3.5,
        "Stars": "★★★✫",
        "Remarks": "These people are very innovative and can do any work with their creative mind. They enjoy their life to the fullest and get attracted towards beautiful things. They earn money easily but can face difficulties due to the opposite sex. They can also do well in politics.\r\nIf they have a wrong name number, the sun will not let luck function in their life. Everything god thing promised in life will take a U-turn and they will not be able to encase in on the opportunities in life.",
        "Profession": "Gems and jewellery, solar power generation, sale of luxury items, technology, electricity, dress material and politics."
    },
    {
        "MB": 62,
        "Ranking": 2.5,
        "Stars": "★★✫",
        "Remarks": "This is not a good combination. They face many ups and downs in their life. They have an analytical mind and are a difficult nut to crack. They would act as a good mediators to solve a dispute. They can earn well if they take up a profession in writing, lawsuits, medicine related. An incompatible name number will give them false send of courage and would drive them to evil habits like alcohol, drugs or other sources of addiction.",
        "Profession": "Arts, business concerned with liquids, alcohol, fuels, chemicals, cultivation of herbs, precious stones and jewellery."
    },
    {
        "MB": 63,
        "Ranking": 0.5,
        "Stars": "✫",
        "Remarks": "6 and 3 both are the no of gurus. No.3 represents dev guru and no. 6 represents daitya guru. People having 6 & 3 struggle a lot in life. They can face many difficulties in their married life. Their actions will be misunderstood by others, even if they are done with a good intent that will make them feel frustrated and depressed. If they have a suitable name number, they will raise high in life in their business/profession and will become famous.",
        "Profession": "Related to arts, literature, fabrics, textiles, items of luxury, and precious stones"
    },
    {
        "MB": 64,
        "Ranking": 3,
        "Stars": "★★★",
        "Remarks": "This is a very good combination. They get success but after a lot of struggle. Both numbers are friends. They should control their ego for getting success. They are very good speakers and can impress the society with their skills. They are bold and love their independence.\r\nIf the name number is not good they will waste their time in gossiping and useless discussions etc.",
        "Profession": "Astrology, hypnotics, medicine, export import, chemicals and drugs, jewellery, dress material, textile business and transport business"
    },
    {
        "MB": 65,
        "Ranking": 4.5,
        "Stars": "★★★★✫",
        "Remarks": "These people are very innovative and can do any work with their creative mind. They enjoy their life to the fullest and get attracted towards beautiful things. They earn money easily but can face difficulties due to the opposite sex. They can also do well in politics. They are role models for the people for their leadership skills and good sense of dressing. If they have a wrong name number, the sun will not let luck function in their life. Everything god thing promised in life will take a U-turn and they will not be able to encase in on the opportunities in life.",
        "Profession": "Life is successful, Gems and jewellery, solar power generation, sale of luxury items, technology, electricity, dress material and politics."
    },
    {
        "MB": 66,
        "Ranking": 4,
        "Stars": "★★★★",
        "Remarks": "Good combination. They get success in every field. They don’t understand the difference between good or bad. Due to that, they face many problems. Sometimes their ego creates problem for them. If the name number is not good, they will create enemies in the family itself and lose many big opportunities to make grand success due to the unclear mind-set.",
        "Profession": "Fashion, gems, jewellery, iron, items of luxury, cosmetics, journalism, paints, textile and goods green in colour."
    },
    {
        "MB": 67,
        "Ranking": 3.5,
        "Stars": "★★★✫",
        "Remarks": "They both have good compatibility. Get success, when they are together. They do well in the field of vastu, reiki, terrot card reading, and media etc.. They are born actors. They might have multiple affairs and having chances of second marriage. They like living alone and are very helpful. If they have a wrong name number, their life will progress very slowly, they will have more instances of failure than of success. They will have a bitter married life and will face delays in childbirth.",
        "Profession": "Artist, writer, speaker, drugs, textiles, luxury goods, chemicals, science, psychology, agriculture and literature."
    },
    {
        "MB": 68,
        "Ranking": 3,
        "Stars": "★★★",
        "Remarks": "The only progress they make in life is through their hard work but they need to put more efforts because of the presence of Saturn which is known to cause delays and disappointments. They are idealists and disciplinarians. They excel in areas like mathematics, transport, astronomy, tools, law and religion. If the name number does not match, the evil impacts of Saturn will increase and will face failures, insults, injuries, accidents, wasteful expenditures etc..",
        "Profession": "Iron & steel, machinery, minerals, grains, fire related business and fuel related businesses."
    },
    {
        "MB": 69,
        "Ranking": 3,
        "Stars": "★★★",
        "Remarks": "They are the boldest amongst all the 6, who take up any task courageously. This number guarantees supreme success due to their strong will power & an undying spirit to work. Difficulties don’t break them rather they face them upfront and overcome them easily. In case of a defective name number, they face a lot of disappointments & failures.",
        "Profession": "Contract work, commission business, vehicles, cosmetics, luxury goods, transport business, production of minerals, fashion perfumes, defence and police."
    },
    {
        "MB": 71,
        "Ranking": 3,
        "Stars": "★★★",
        "Remarks": "This is an average number. Even we know and no. 1 is there to support No. 7 (Shadow, Ketu), even then can taste failures in life. These people can do well in Vastu, Astrology, Terrot card Reading, Healing etc.. They get cheated by others. They trust god and will take a keen interest in religion and would want to explore it more to understand it deeply. If the name number mismatches 7-1, things will go against them and the credit due to you will be taken by others.",
        "Profession": "Textiles, metals, electricity, chemicals, drugs, perfumes, computer multimedia or luxury and costly items."
    },
    {
        "MB": 72,
        "Ranking": 2.5,
        "Stars": "★★✫",
        "Remarks": "This is not a good number. Because 7 represents Ketu and 2 represents (Queen). This number represents a brainless person (7 Ketu, only body, no head) and 2 is a very sensitive number, (represents moon and queen). they always have a smile on their face. If the name number mismatches, they will loose many opportunities to make money or even if they grab it end result would be far from satisfactory.",
        "Profession": "Teaching / Occult, Best Intuition Power, Writing, delivering lectures or speeches, water related business, export, agriculture poetry and painting."
    },
    {
        "MB": 73,
        "Ranking": 4,
        "Stars": "★★★★",
        "Remarks": "This number promises happiness and success. They will be a mixture of tradition and modernity, practical knowledge & knowledge gained through experience. They will come forward and take a keen interest in the development of the society, will work tirelessly.\r\nIf the name number mismatches, they will face unnecessary complications, a disputed married and social life etc..",
        "Profession": "Spiritual teacher, yoga instructor, trading, pharmaceuticals, beverage, miners, educational institution, financial institution and metals."
    },
    {
        "MB": 74,
        "Ranking": 4,
        "Stars": "★★★★",
        "Remarks": "They can sense the good or bad events of the future, they are gifted that way. They will remain confused between living a life of riches and forsaking everything and work for the highest form of spiritual bliss. They are interested in art, music, astrology & medicine.\r\nIf the name number mismatches, financial success will be a far cry, confusion will prevail & failures are bound to happen, domestic wife would be a mess.",
        "Profession": "Arts, speaker, writer, publisher, cosmetics, cinema, Computer & electrical appliances etc.."
    },
    {
        "MB": 75,
        "Ranking": 3,
        "Stars": "★★★",
        "Remarks": "They have a good capacity to think and are mentally alert. They always try working towards better life getting involved in any trade or industry. As soon as they see a new thing, their mind starts to function and collects information about it. They acquire huge properties and prosperity. If the name number mismatches, they would face a lot of mental suffering and face troublesome situations.",
        "Profession": "Mass communication, writing, educationist, speaker at religious gatherings, farming, metals"
    },
    {
        "MB": 76,
        "Ranking": 3.5,
        "Stars": "★★★✫",
        "Remarks": "They are blessed health, wealth and a good family life. They are having a luxurious life style. Before starting any task, they will see its pros and cons. They like spending time with theirself. They are interested towards music, religion, astrology etc. If the name number mismatches, there would be discord at the family front, progress in life would be really slow despite opportunities available & suffer from ill-health.",
        "Profession": "Mass communication, writing, educationist, speaker at religious gatherings, farming, metals"
    },
    {
        "MB": 77,
        "Ranking": 1,
        "Stars": "★",
        "Remarks": "This is the best number for spiritual growth. They will be tidy in their appearance and will always be engrossed in thought. They will never discuss their issues with anyone and will never be a reason for someone’s pain. They will derive gains from foreign sources and will be will be acknowledged as philosophers. If the name number mismatches, business and personal life both will suffer. Despite the talents, they would not achieve success in life leading to disappointments & dissatisfaction.",
        "Profession": "God man, astrologer, spirituality, import/export, mineral, agriculture, automobiles, electricity, computer and law."
    },
    {
        "MB": 78,
        "Ranking": 1,
        "Stars": "★",
        "Remarks": "They are hard working. Obstacles are a part of their life which they encounter at every step of life but their hard work & commitment to the task helps them reach their objective with a delay. As time passes they learn to swim against the current. They are physically strong & achieve success later than their peers. If the name number mismatches, failure sets in their life and marriage is delayed or even denied. Failures make them unlawful means to gain wealth which can land them in deep trouble.",
        "Profession": "Machinery, iron and steel, drugs, computers, metals, electronics, stationery"
    },
    {
        "MB": 79,
        "Ranking": 1,
        "Stars": "★",
        "Remarks": "They have a number of friends who would go to any to be of help to them. Quick in their work, they complete their tasks at breakneck speed. They get involved in multiple projects at the same time. They would enjoy high positions in jobs or business and will lead a happy and successful life.\r\nIf the name number mismatches, it gives problems in the family happiness or low earnings. They would indulge in unnecessary matters and invite trouble for themself.",
        "Profession": "Real estate, buildings, construction, mills iron, printing press, police, defence, spiritual life related line, electricity etc."
    },
    {
        "MB": 81,
        "Ranking": 0.5,
        "Stars": "✫",
        "Remarks": "This is not a good combination as Shanidev was Surya’s (No. 1, King) father. But they never liked his father. They don’t get enough of their efforts. They have the capability and knowledge but don’t get the good result of their efforts. Even after having so many chances, they don’t take advantage of that.\r\nIf the name number mismatches, Saturn brings a lot of adversities in the life. They will have stomach ailments. Their life is afflicted due to fire, theft, accidents and even will have suicidal tendencies.",
        "Profession": "Scientist, doctor, engineer, professor, ad agencies, electronics, computer, iron and steel, and other administrative"
    },
    {
        "MB": 82,
        "Ranking": 0.5,
        "Stars": "✫",
        "Remarks": "Not a good number. But shanidev and no. 2, Moon, Queen are not friends. As shani represents iron and moon represents water. And its the water only who destroys the iron. So they face a lot of struggle in their life. They are physically strong but mentally weak and will remain in a state of confusion. If the name number mismatches, their family life will be full of confusion, unstable mind, failures and setbacks would be a common phenomenon. Precaution in Health (2(Water) - Queen and 8(Iron)- Stepson). ",
        "Profession": "Lawyer, engineer, professor, iron and steel , machinery, farming, agriculture, vehicles, oil and printing are all suitable."
    },
    {
        "MB": 83,
        "Ranking": 2,
        "Stars": "★★",
        "Remarks": "This is a good combination. Because shanidev ji always listens to his guru. When guru teaches him and helps him then they try his best to listen him. They believe in justice and honesty. They are full of wisdom and knowledge due to which people come to them for advice. They reach a top position in spite of adversities in life. If the name number mismatches, they face problems with their finances, children and family life. A lot of wasteful expenditure would be there.",
        "Profession": "Lawyer, astrologer, engineer, arts, dress, jewellery, chemicals, oil, iron and steel, machinery, or vehicles can be adopted."
    },
    {
        "MB": 84,
        "Ranking": 1,
        "Stars": "★",
        "Remarks": "They do not like to handover control to anyone. They enjoy the support of the masses. They are the master when it comes to dealing and handling machinery i.e. they are the mechanical type. If the name number mismatches, Rahu and Saturn will make a life full of struggles, opportunities will slip through the hands, bad luck will prevail and will lead to destruction in all spheres.",
        "Profession": "Iron and steel, writer, speaker, automobile, chemical, export/import, minerals, fuels, marketing"
    },
    {
        "MB": 85,
        "Ranking": 3,
        "Stars": "★★★",
        "Remarks": "They are successful businessmen and traders because of their sharp intellect. They may face hardships in the beginning or in the middle of the project but their hard work and meticulous way of doing things helps them reach the shore. They expect the same behavious from people working under them. If the name number mismatches, it delays their achievement, make them prone to chronic diseases, they would be pushed into evil ways.",
        "Profession": "Metals, iron and steel, mechanical engineers, marketing, textiles, farming, vehicles, jewellery, accountants, teachers, doctors, surgeons and biotechnology."
    },
    {
        "MB": 86,
        "Ranking": 3,
        "Stars": "★★★",
        "Remarks": "No. 8 and 6, both are friends. They are full of sympathy. They desire luxury and material riches in their life but their journey to the top required more efforts than others. They have a deep desire to become famous and will achieve the fame though late in life. They are born artists with a creative bent of mind.If the name number mismatches, stomach ailments are common, they get into vices like alcohol, women and drugs. They are inclined to marry twice or get into multiple affairs.",
        "Profession": "Machinery, metals, minerals, iron and steel, event management, textiles, boutiques, vehicles, computer and law."
    },
    {
        "MB": 87,
        "Ranking": 1,
        "Stars": "★",
        "Remarks": "They are good at keeping secrets and always a look at contemplation on their faces. They are gracious and full of sympathy. They earn a good name wherever you go. Sometimes they prefer loneliness. As they pass through ordeals, life teaches them a lot of lessons.\r\nIf the name number mismatches, earnings would be inadequate, poor state of health, bring a bad name to the family and would be prone to accidents.",
        "Profession": "Lawyer, scientist, government officer, engineer, professor, writer, speaker, painter, vehicles, grains, gems, iron and steel and heavy machinery."
    },
    {
        "MB": 88,
        "Ranking": 1,
        "Stars": "★",
        "Remarks": "They may suffer from poverty in their youth. Difficulties and obstacles would dominate a substantial part of their life. They will extend their helping hand to their family and loved ones in need. They will have a good amount of friends, who will help them in their time of crisis.\r\nIf the name number mismatches, Saturn would bring a lot of miseries, downfalls, accidents, theft in worst cases even murder.",
        "Profession": "Iron and steel, machinery, fire, electricity, logistics, vehicles, real estate, printing press, book publications, and mining."
    },
    {
        "MB": 89,
        "Ranking": 1.5,
        "Stars": "★✫",
        "Remarks": "They can be a hero or prisoner depending on their name number. A good name number would give them the power to govern. They would work so hard that even a non productive asset would yield the result. Their speeches will have mass appeal. Problems would appear small in front of the courage they would possess.If the name number mismatches, their aggression will land them into trouble. Their basic instincts turn negative and then would turn to a thief, criminal, gangster or even a terrorist.",
        "Profession": "Political leader, speaker, profession related to real estate, landed property, vehicles, minerals, mines, drugs, chemicals, arms and ammunition, police and defence personnel etc."
    },
    {
        "MB": 91,
        "Ranking": 5,
        "Stars": "★★★★★",
        "Remarks": "This is a very good combination. It gives success. Because this 9 no is loyal to no 1, as Raja relies on him only. They have administrative skills and can be powerful leaders. They are intelligent , alert, and quick. They have a sense of appeal about themselves. they will have a number of friends.\r\nIf the name number mismatches, problems would be due to women, and there would be losses in business. Also, there is a possibility of imprisonment & court cases.",
        "Profession": "Super Successful, Drugs, arms & ammunition, stone, real estate, fire-related, crackers, building material, marketing, explosives, metals and politics etc.."
    },
    {
        "MB": 92,
        "Ranking": 1,
        "Stars": "★",
        "Remarks": "This is an average combination. Bcoz both are not against each other but they r having no similarities also. Bcoz of this unusual combination, this no. sometimes face failures. They don’t get enough of their hardwork. These people are very sensitive and accept failures very easily. If the name number mismatches, they will lead a hopeless life. They will get addicted to drinks and women. They will pick up quarrels at the deop of a hat.",
        "Profession": "Alcohal, drugs, chemicals, arts, agriculture, vehicle, hotel, architecture, export/import and engineering."
    },
    {
        "MB": 93,
        "Ranking": 4,
        "Stars": "★★★★",
        "Remarks": "This is a good number. Because guru and judge both are not having any direct relation. Even then, they respect each other, and advice them. If these people start doing social work, they can do very well and secondly good for their future also. They can do well in computers, astrology, vastu, healing, numerology etc..\r\nIf the name number mismatches, education may face issues, family life gets disturbed, native gets affected by chronic diseases etc...",
        "Profession": "Scientist, industrialist, top government official, police, army, surgeon etc.."
    },
    {
        "MB": 94,
        "Ranking": 1,
        "Stars": "★",
        "Remarks": "Both these numbers plays the same role. Both are daring. They are able to garner the support of the masses with their knowledge and candour. They can make for great politicians, army personnel, police officers or high ranking government officials and will be able to achieve feats that on one else has.\r\nIf the name number mismatches, they will have to struggle really hard to make progress, even if they rise, they will again fall down to their original position and court cases would be plenty.",
        "Profession": "Army office, police department official, government official, detective, surgeon, real estate, fuels, chemicals, explosives or gun."
    },
    {
        "MB": 95,
        "Ranking": 3,
        "Stars": "★★★",
        "Remarks": "This no. gives success. They are physically and mentally strong and want progress in life. They are responsible businessmen and professionals. Unmoved by the obstacles that they face in the early par of their life, they continue to march ahead aiming at their goal.\r\nIf the name number mismatches, there will be a financial trouble, ill health, underutilization of the capacity of work, property hassles etc..",
        "Profession": "Doctor, engineer, industrialist, teacher, government official, property dealer, real estate agent"
    },
    {
        "MB": 96,
        "Ranking": 3,
        "Stars": "★★★",
        "Remarks": "They have the ability to captivate others by their charm. They have excellent speaking and writing skills. Their sense of dressing, mannerism are attractive. They would return the goof for the good and bad for the bad. They have magnetic powers to attract people towards themselves. If the name number defective, life will be a struggle for them. Since they won’t be able to make money money through legal sources they will resort to illegal means for making money.",
        "Profession": "Successful, Scandals, Controversies, Luxuty goods, entertainment, event management, architecture, fashion designer, writer, painter and sculpture."
    },
    {
        "MB": 97,
        "Ranking": 1,
        "Stars": "★",
        "Remarks": "They have an unsteady mind and are in a state of confusion. This is a very dangerous combination to have so they need to be careful while selecting names. They have good knowledge of philosophy, religion and law, magic, yoga and other occult related subjects. If they have a correct name number, they will shine as wise men.\r\nIf the name number defective, wrong irreparable decisions will be taken, they will earn a bad name in the society, and many opportunities will be lost.",
        "Profession": "Spiritual preacher, lawyer, engineer, poet, lyricist or can be engaged in businesses such as real estate, electricity, military equipment and gemstones."
    },
    {
        "MB": 98,
        "Ranking": 1,
        "Stars": "★",
        "Remarks": "Though struggles in life would come in huge number, but they might have the face the struggles very boldly. Full of self-confidence and courage, they have the conviction to succeed in anything that they take up. They have clarity of thought. They have past experience when it comes to knowledge of the worldly matters due to the constant struggles in their life.\r\nIf the name number defective, they get into tricky situations which they are incompetent of handling, luck works against them and gives them unnecessary delays & sufferings, brings in financial distress & family issues.",
        "Profession": "Iron & steel , property related profession, automobiles, agriculture, machinery manufacturing, arms and ammunition fuel "
    },
    {
        "MB": 99,
        "Ranking": 1,
        "Stars": "★",
        "Remarks": "They are extremely courageous, forceful, commanding, diplomatic & leaders. They are extremely quick when it comes to taking a decision or doing a task. They are active, alert and bold. No one has the ability to change their set ideals.\r\nIf the name number defective, they can become nefarious elements of the society like convicts or criminals, earn a bad name, face major ups and downs, and pick up conflicts at the drop of a hat.",
        "Profession": "Possible problem in relations / Army / Police, Major of the army, navy or air force, police, civil engineer, architect, lawyer, doctor, professor, share market, gems, electricity and fire."
    }
]