[
    {
        "No.": 1,
        "Times": 3,
        "Yogs": "Mental Yog",
        "Details": "Your Mental Strength is very strog, You are intellectual  Memory very sharp, God gifted brain, Think differently than others,  you have Photographic memory."
    },
    {
        "No.": 1,
        "Times": 2,
        "Yogs": "Mental Yog",
        "Details": "Your Mental Strength is good, Your Memory is good, Think differently than others"
    },
    {
        "No.": 1,
        "Times": 1,
        "Yogs": "Mental Yog",
        "Details": "Your line of Mental Capability in the Ank Kundali is average. You are not a good thinker or a planner. you need to use your brain and knowledge effectively when needed. you do not have a good memory."
    },
    {
        "No.": 1,
        "Times": 0,
        "Yogs": "Mental Yog",
        "Details": "Your Mental Strength is not good, your memory is poor"
    },
    {
        "No.": 2,
        "Times": 3,
        "Yogs": "Emotional Yog",
        "Details": "You are very much emotional. Line of emotion shows that you are a good person. You can do your work peacefully without getting distracted. Your heart rules over the heads. You have golden heart. you can trust easily."
    },
    {
        "No.": 2,
        "Times": 2,
        "Yogs": "Emotional Yog",
        "Details": "Your emotion line is good, you think and take decision emotional, you have good heart."
    },
    {
        "No.": 2,
        "Times": 1,
        "Yogs": "Emotional Yog",
        "Details": "You emotional capacity in the ank kundali is average, you are not much emotional."
    },
    {
        "No.": 2,
        "Times": 0,
        "Yogs": "Emotional Yog",
        "Details": "You are not emotional and you cannot trust anyone."
    },
    {
        "No.": 3,
        "Times": 3,
        "Yogs": "Pratical Yog",
        "Details": "You are pratical,  you are going into the depth of anything. You apply logical, analytical, scientific way of thinking and understanding,  Prefers to learn from own experience and not others, very good managing finance"
    },
    {
        "No.": 3,
        "Times": 2,
        "Yogs": "Pratical Yog",
        "Details": "You practical line is good, your take practical decision, you can apply logic, analysis, can manage finance easily."
    },
    {
        "No.": 3,
        "Times": 1,
        "Yogs": "Pratical Yog",
        "Details": "You do not like to use facts, figures and logic You have a practical approach and not like to get into depth of the situation by asking questions. Try not to leave tasks unfinished."
    },
    {
        "No.": 3,
        "Times": 0,
        "Yogs": "Pratical Yog",
        "Details": "You do not like to use facts, figures and logic You have a practical approach and not like to get into depth of the situation by asking questions. Try not to leave tasks unfinished."
    },
    {
        "No.": 4,
        "Times": 3,
        "Yogs": "Thought Yog",
        "Details": "Your farsightedness is very good and you are very good thinker, Your visualization power is very strong, you are Disciplined & Organized"
    },
    {
        "No.": 4,
        "Times": 2,
        "Yogs": "Thought Yog",
        "Details": "Your forevision is good, you are good visualiser, you are discipline and organised."
    },
    {
        "No.": 4,
        "Times": 1,
        "Yogs": "Thought Yog",
        "Details": "Your farsightedness is average along with the thinking process. You are not good in planning and organization. You are a creative person or a visualizer."
    },
    {
        "No.": 4,
        "Times": 0,
        "Yogs": "Thought Yog",
        "Details": "Your thinking process is not good, you are not creative and depends on others for planning, "
    },
    {
        "No.": 5,
        "Times": 3,
        "Yogs": "Will Power Yog",
        "Details": "Your will power is very strong, you can adjust with any situation. You can bounce back from difficult situations. Your determination and fighting spirits are very good. work hard for your success which you will get."
    },
    {
        "No.": 5,
        "Times": 2,
        "Yogs": "Will Power Yog",
        "Details": "Your will power is good, you have a fighting spirits, may have ability to bounce back in difficult situation"
    },
    {
        "No.": 5,
        "Times": 1,
        "Yogs": "Will Power Yog",
        "Details": "Your will power is not good, you have to do lots of hardwork to get success."
    },
    {
        "No.": 5,
        "Times": 0,
        "Yogs": "Will Power Yog",
        "Details": "You lack will power and decision power."
    },
    {
        "No.": 6,
        "Times": 3,
        "Yogs": "Action Yog",
        "Details": "You are  Action Oriented, you have very quick approach to solve problems. You do not like to sit ideal.  Always likes to be in action (some time without thinking)."
    },
    {
        "No.": 6,
        "Times": 2,
        "Yogs": "Action Yog",
        "Details": "You are action oriented and take action easily some time without thinking."
    },
    {
        "No.": 6,
        "Times": 1,
        "Yogs": "Action Yog",
        "Details": "You have an average Action Line which shows that you are not an action oriented person. You might not be prone to quick decisions and actions which can be a strength or weakness depend on the situation so I would advice to think and act on your thoughts. You should plan and think thoroughly and then start taking actions on those thoughts and plans."
    },
    {
        "No.": 6,
        "Times": 0,
        "Yogs": "Action Yog",
        "Details": "You doesnot take action quickly, you depends on others to take decision"
    },
    {
        "No.": 7,
        "Times": 3,
        "Yogs": "Rajyog Yog",
        "Details": "A full RajYog is very rare to find in the Ank kundali and Wow, Rajyog in this Kundali is best"
    },
    {
        "No.": 7,
        "Times": 2,
        "Yogs": "Rajyog Yog",
        "Details": "A full RajYog is very rare to find in the Ank kundali and Rajyog in this Kundali is good"
    },
    {
        "No.": 7,
        "Times": 1,
        "Yogs": "Rajyog Yog",
        "Details": "A full RajYog is very rare to find in the Ank kundali and Rajyog in this Kundali is average"
    },
    {
        "No.": 7,
        "Times": 0,
        "Yogs": "Rajyog Yog",
        "Details": "A full RajYog is very rare to find in the Ank kundali and Rajyog in this Kundali is below average"
    },
    {
        "No.": 8,
        "Times": 3,
        "Yogs": "Property Yog",
        "Details": "Wow, You have chance to make your own proerties"
    },
    {
        "No.": 8,
        "Times": 2,
        "Yogs": "Property Yog",
        "Details": "You have chance to have Property or Land at later Stage of your life"
    },
    {
        "No.": 8,
        "Times": 1,
        "Yogs": "Property Yog",
        "Details": "Chances of retaining properties are average."
    },
    {
        "No.": 8,
        "Times": 0,
        "Yogs": "Property Yog",
        "Details": "Chances of retaining properties are below average."
    }
]